# Starbucks Capstone Project

## Objective:

The goal of this project is to be able to understand which methods of incentives/offers work best for different demographics. Particularly in this project, it will be predicted whether or not the person responds to the offer, given the person and offer characteristics.

## Background:

The data for this project has been provided by Starbucks. This data set contains simulated data that mimics customer behavior on the Starbucks rewards mobile app. Once every few days, Starbucks sends out an offer to users of the mobile app. An offer can be merely an advertisement for a drink or an actual offer such as a discount or BOGO (buy one get one free). Some users might not receive any offer during certain weeks. This simulator has only one product offering and hence is a simpler version of the real Starbucks app.

## Data Gathering

The data has been downloaded from Udacity workspace. These files will be read into dataframes

In [283]:
import pandas as pd
import numpy as np
import math
import json
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")

In [284]:
# read in the json files
portfolio = pd.read_json('data/portfolio.json', orient='records', lines=True)
profile = pd.read_json('data/profile.json', orient='records', lines=True)
transcript = pd.read_json('data/transcript.json', orient='records', lines=True)

In [285]:
portfolio.head()

,reward,channels,difficulty,duration,offer_type,id
0,10,"[email, mobile, social]",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd
1,10,"[web, email, mobile, social]",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0
2,0,"[web, email, mobile]",0,4,informational,3f207df678b143eea3cee63160fa8bed
3,5,"[web, email, mobile]",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9
4,5,"[web, email]",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7

In [286]:
profile.head()

  gender  age                                id  became_member_on    income
0   None  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1      F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2   None  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3      F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4   None  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN

In [287]:
transcript.head()

,person,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0

## Data Description
The data is contained in three files:

* portfolio.json - containing offer ids and meta data about each offer (duration, type, etc.)
* profile.json - demographic data for each customer
* transcript.json - records for transactions, offers received, offers viewed, and offers completed

Here is the schema and explanation of each variable in the files:

**portfolio.json**
* id (string) - offer id
* offer_type (string) - type of offer ie BOGO, discount, informational
* difficulty (int) - minimum required spend to complete an offer
* reward (int) - reward given for completing an offer
* duration (int) - time for offer to be open, in days
* channels (list of strings)

**profile.json**
* age (int) - age of the customer 
* became_member_on (int) - date when customer created an app account
* gender (str) - gender of the customer (note some entries contain 'O' for other rather than M or F)
* id (str) - customer id
* income (float) - customer's income

**transcript.json**
* event (str) - record description (ie transaction, offer received, offer viewed, etc.)
* person (str) - customer id
* time (int) - time in hours since start of test. The data begins at time t=0
* value - (dict of strings) - either an offer id or transaction amount depending on the record

## Data Wrangling

### Data Assessment

In [288]:
print('Shape of portflio: ', portfolio.shape)
print('Shape of profile: ', profile.shape)
print('Shape of trancript: ', transcript.shape)

Shape of portflio:  (10, 6)
Shape of profile:  (17000, 5)
Shape of trancript:  (306534, 4)

In [289]:
portfolio.isnull().sum()

reward        0
channels      0
difficulty    0
duration      0
offer_type    0
id            0
dtype: int64

In [290]:
portfolio.offer_type.unique()

array(['bogo', 'informational', 'discount'], dtype=object)

In [291]:
set(portfolio.channels.explode())

{'email', 'mobile', 'social', 'web'}

In [292]:
profile.isnull().sum()

gender              2175
age                    0
id                     0
became_member_on       0
income              2175
dtype: int64

In [293]:
profile[profile.gender.isnull()&profile.income.isnull()]

      gender  age                                id  became_member_on  income
0       None  118  68be06ca386d4c31939f3a4f0e3dd783          20170212     NaN
2       None  118  38fe809add3b4fcf9315a9694bb96ff5          20180712     NaN
4       None  118  a03223e636434f42ac4c3df47e8bac43          20170804     NaN
6       None  118  8ec6ce2a7e7949b1bf142def7d0e0586          20170925     NaN
7       None  118  68617ca6246f4fbc85e91a2a49552598          20171002     NaN
...      ...  ...                               ...               ...     ...
16980   None  118  5c686d09ca4d475a8f750f2ba07e0440          20160901     NaN
16982   None  118  d9ca82f550ac4ee58b6299cf1e5c824a          20160415     NaN
16989   None  118  ca45ee1883624304bac1e4c8a114f045          20180305     NaN
16991   None  118  a9a20fa8b5504360beb4e7c8712f8306          20160116     NaN
16994   None  118  c02b10e8752c4d8e9b73f918558531f7          20151211     NaN

[2175 rows x 5 columns]

In [22]:
profile.age.describe()

count    17000.000000
mean        62.531412
std         26.738580
min         18.000000
25%         45.000000
50%         58.000000
75%         73.000000
max        118.000000
Name: age, dtype: float64

In [294]:
profile[profile.age>100].age.unique()

array([118, 101], dtype=int64)

In [295]:
profile[profile.age==118]

      gender  age                                id  became_member_on  income
0       None  118  68be06ca386d4c31939f3a4f0e3dd783          20170212     NaN
2       None  118  38fe809add3b4fcf9315a9694bb96ff5          20180712     NaN
4       None  118  a03223e636434f42ac4c3df47e8bac43          20170804     NaN
6       None  118  8ec6ce2a7e7949b1bf142def7d0e0586          20170925     NaN
7       None  118  68617ca6246f4fbc85e91a2a49552598          20171002     NaN
...      ...  ...                               ...               ...     ...
16980   None  118  5c686d09ca4d475a8f750f2ba07e0440          20160901     NaN
16982   None  118  d9ca82f550ac4ee58b6299cf1e5c824a          20160415     NaN
16989   None  118  ca45ee1883624304bac1e4c8a114f045          20180305     NaN
16991   None  118  a9a20fa8b5504360beb4e7c8712f8306          20160116     NaN
16994   None  118  c02b10e8752c4d8e9b73f918558531f7          20151211     NaN

[2175 rows x 5 columns]

In [296]:
transcript.isnull().sum()

person    0
event     0
value     0
time      0
dtype: int64

In [297]:
transcript.event.unique()

array(['offer received', 'offer viewed', 'transaction', 'offer completed'],
      dtype=object)

In [298]:
transcript.time.describe()

count    306534.000000
mean        366.382940
std         200.326314
min           0.000000
25%         186.000000
50%         408.000000
75%         528.000000
max         714.000000
Name: time, dtype: float64

**portfolio**
1. There are three types of offers bogo, discount and informational
2. There are four unique channels: email, web, social and mobile
3. The channels column has a list of each of the channels used. This can be changed as dummy with each channel as a column

**profile**
1. Profile has missing values for gender and income columns, both of which are missing for same person ids
2. The age for the person ids with missing values for gender is 118
3. became_member_on is of int type but should be datetime object

**transcript**
1. There are 4 types of events: offer received, offer viewed, transaction, offer completed
2. value column is in dictionary format. It should be changed to just the value
3. transcipt dataframe is in long format with each event as row. The data can be split into two datframes one for offer events and other for transactions. This can then be converted to wide format with one row for person and offer pair for ease of use in analysis
4. The last event recorded was 714 hours after the experiment started

### Data Cleaning

**Creating new column for each channel in portfolio dataframe**

In [299]:
unique_channels=set(portfolio.channels.explode())
for channel in unique_channels:
    portfolio[channel]=portfolio.channels.apply(lambda x: 1 if (channel in x) else 0)

In [300]:
portfolio.head()

,reward,channels,difficulty,duration,offer_type,id,social,web,email,mobile
0,10,"[email, mobile, social]",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd,1,0,1,1
1,10,"[web, email, mobile, social]",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0,1,1,1,1
2,0,"[web, email, mobile]",0,4,informational,3f207df678b143eea3cee63160fa8bed,0,1,1,1
3,5,"[web, email, mobile]",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,0,1,1,1
4,5,"[web, email]",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7,0,1,1,0

In [301]:
portfolio.drop(columns=['channels'],inplace=True)

**Drop rows with missing values for income, gender or 118 for age in profile**

In [302]:
profile.dropna(inplace=True)

In [303]:
#check for age==118
(profile.age==118).sum()

0

In [304]:
#check for missing values
profile.isnull().sum()

gender              0
age                 0
id                  0
became_member_on    0
income              0
dtype: int64

**Converting became_member_on to datetime object in profile**

In [305]:
profile['became_member_on']=pd.to_datetime(profile['became_member_on'], format='%Y%m%d')

In [306]:
profile.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14825 entries, 1 to 16999
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   gender            14825 non-null  object
 1   age               14825 non-null  int64
 2   id                14825 non-null  object
 3   became_member_on  14825 non-null  datetime64[ns]
 4   income            14825 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 694.9+ KB

5. Splitting transcript data into two dataframe

In [307]:
transactions=transcript.query('event=="transaction"')
offer_events=transcript.query('event!="transaction"')

In [308]:
transactions.head()

,person,event,value,time
12654,02c083884c7d45b39cc68e1314fec56c,transaction,{'amount': 0.8300000000000001},0
12657,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,transaction,{'amount': 34.56},0
12659,54890f68699049c2a04d415abc25e717,transaction,{'amount': 13.23},0
12670,b2f1cd155b864803ad8334cdf13c4bd2,transaction,{'amount': 19.51},0
12671,fe97aa22dd3e48c8b143116a8403dd52,transaction,{'amount': 18.97},0

In [309]:
transactions.event.unique()

array(['transaction'], dtype=object)

In [310]:
offer_events.head()

,person,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0

In [311]:
offer_events.event.unique()

array(['offer received', 'offer viewed', 'offer completed'], dtype=object)

6. Changing value column format in both transactions and offer_events

In [312]:
offer_events['offer_id']=offer_events.value.apply(lambda x: list(x.values())[0])

In [313]:
transactions['amount']=transactions.value.apply(lambda x: list(x.values())[0])

In [314]:
offer_events.drop(columns=['value'],inplace=True)
transactions.drop(columns=['value'],inplace=True)

In [315]:
offer_events.head()

,person,event,time,offer_id
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9
1,a03223e636434f42ac4c3df47e8bac43,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7
2,e2127556f4f64592b11af22de27a7932,offer received,0,2906b810c7d4411798c6938adc9daaa5
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,0,fafdcd668e3743c1bb461111dcafc2a4
4,68617ca6246f4fbc85e91a2a49552598,offer received,0,4d5c57ea9a6940dd891ad53e9dbe8da0

In [316]:
transactions.head()

                                 person        event  time  amount
12654  02c083884c7d45b39cc68e1314fec56c  transaction     0    0.83
12657  9fa9ae8f57894cc9a3b8a9bbe0fc1b2f  transaction     0   34.56
12659  54890f68699049c2a04d415abc25e717  transaction     0   13.23
12670  b2f1cd155b864803ad8334cdf13c4bd2  transaction     0   19.51
12671  fe97aa22dd3e48c8b143116a8403dd52  transaction     0   18.97

In [317]:
#check for missing values
offer_events.isnull().sum()

person      0
event       0
time        0
offer_id    0
dtype: int64

In [318]:
#check for missing values
transactions.isnull().sum()

person    0
event     0
time      0
amount    0
dtype: int64

7. Converting offer_events dataframe to wide format

In [319]:
person_offer=pd.pivot_table(data=offer_events,index=['person','offer_id'],columns=['event'],values=['time']).reset_index()

In [320]:
columns=['person','offer_id','offer_completed_time','offer_received_time','offer_viewed_time']
person_offer.columns=columns

In [321]:
person_offer.head()

,person,offer_id,offer_completed_time,offer_received_time,offer_viewed_time
0,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,576.0,NaN
1,0009655768c64bdeb2e877511632db8f,3f207df678b143eea3cee63160fa8bed,NaN,336.0,372.0
2,0009655768c64bdeb2e877511632db8f,5a8bc65990b245e5a138643cd4eb9837,NaN,168.0,192.0
3,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,414.0,408.0,456.0
4,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,528.0,504.0,540.0

In [322]:
person_offer.isnull().sum()

person                      0
offer_id                    0
offer_completed_time    34292
offer_received_time         0
offer_viewed_time       14153
dtype: int64

Since the last event occuurent at time=714, replacing all nans with 1000

In [323]:
person_offer.fillna(1000,inplace=True)

In [324]:
person_offer.isnull().sum()

person                  0
offer_id                0
offer_completed_time    0
offer_received_time     0
offer_viewed_time       0
dtype: int64

### Consolidating data

In [427]:
#merging person_offer and profile dataframes
#using left merge as we need all person data
df_clean=pd.merge(profile,person_offer,left_on='id', right_on='person',how='left')
print(df_clean.shape)
df_clean.head()

(55227, 10)

,gender,age,id,became_member_on,income,person,offer_id,offer_completed_time,offer_received_time,offer_viewed_time
0,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,0610b486422d4921ae7d2bf64640c50b,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0
1,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,0610b486422d4921ae7d2bf64640c50b,9b98b8c7a33c4b65b9aebfe6a799e6d9,528.0,408.0,1000.0
2,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,78afa995795e4d85b5d9ceeca43f5fef,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0
3,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,78afa995795e4d85b5d9ceeca43f5fef,9b98b8c7a33c4b65b9aebfe6a799e6d9,132.0,0.0,6.0
4,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,78afa995795e4d85b5d9ceeca43f5fef,ae264e3637204a6fb9bb56bc8210ddfd,510.0,408.0,408.0

In [428]:
df_clean.isnull().sum()

gender                  0
age                     0
id                      0
became_member_on        0
income                  0
person                  5
offer_id                5
offer_completed_time    5
offer_received_time     5
offer_viewed_time       5
dtype: int64

Five people did not receive any offers. Here again the nas will be replaced by 1000 for time columns and empty string for offer_id. Person column can be dropped.

In [429]:
#renaming id as person_id
df_clean.rename(columns={'id':'person_id'},inplace=True)

In [430]:
#drop person column
df_clean.drop(columns=['person'],inplace=True)

In [431]:
#replace na with "" in offer_id
df_clean.offer_id.fillna('',inplace=True)

In [432]:
#replace na with 1000 in time columns
df_clean.fillna(1000,inplace=True)

In [433]:
df_clean.isnull().sum()

gender                  0
age                     0
person_id               0
became_member_on        0
income                  0
offer_id                0
offer_completed_time    0
offer_received_time     0
offer_viewed_time       0
dtype: int64

In [434]:
#merging df_clean with portfolio dataframe
df_clean=pd.merge(df_clean, portfolio, left_on='offer_id', right_on='id',how='left')
print(df_clean.shape)
df_clean.head()

(55227, 18)

,gender,age,person_id,became_member_on,income,offer_id,offer_completed_time,offer_received_time,offer_viewed_time,reward,difficulty,duration,offer_type,id,social,web,email,mobile
0,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0,0.0,0.0,4.0,informational,3f207df678b143eea3cee63160fa8bed,0.0,1.0,1.0,1.0
1,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,528.0,408.0,1000.0,5.0,5.0,7.0,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,0.0,1.0,1.0,1.0
2,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,0.0,3.0,informational,5a8bc65990b245e5a138643cd4eb9837,1.0,0.0,1.0,1.0
3,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,132.0,0.0,6.0,5.0,5.0,7.0,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,0.0,1.0,1.0,1.0
4,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,ae264e3637204a6fb9bb56bc8210ddfd,510.0,408.0,408.0,10.0,10.0,7.0,bogo,ae264e3637204a6fb9bb56bc8210ddfd,1.0,0.0,1.0,1.0

In [435]:
df_clean.isnull().sum()

gender                  0
age                     0
person_id               0
became_member_on        0
income                  0
offer_id                0
offer_completed_time    0
offer_received_time     0
offer_viewed_time       0
reward                  5
difficulty              5
duration                5
offer_type              5
id                      5
social                  5
web                     5
email                   5
mobile                  5
dtype: int64

In [436]:
#drop id column
df_clean.drop(columns=['id'],inplace=True)

In [437]:
#Replacing missing offer type with None
df_clean.offer_type.fillna('None',inplace=True)

In [438]:
#Replacing all other missing values with 0
df_clean.fillna(0,inplace=True)

In [439]:
#Recheck
df_clean.isnull().sum().sum()

0

In [440]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 55227 entries, 0 to 55226
Data columns (total 17 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   gender                55227 non-null  object
 1   age                   55227 non-null  int64
 2   person_id             55227 non-null  object
 3   became_member_on      55227 non-null  datetime64[ns]
 4   income                55227 non-null  float64
 5   offer_id              55227 non-null  object
 6   offer_completed_time  55227 non-null  float64
 7   offer_received_time   55227 non-null  float64
 8   offer_viewed_time     55227 non-null  float64
 9   reward                55227 non-null  float64
 10  difficulty            55227 non-null  float64
 11  duration              55227 non-null  float64
 12  offer_type            55227 non-null  object
 13  social                55227 non-null  float64
 14  web                   55227 non-null  float64
 15  email                 55227 non-null  float64
 16  mobile                55227 non-null  float64
dtypes: datetime64[ns](1), float64(11), int64(1), object(4)
memory usage: 7.6+ MB

Merging df_clean and transactions. This will be a many to many join

In [441]:
#merging df_clean and transactions
df_trn=pd.merge(df_clean,transactions,left_on='person_id',right_on='person',how='left')

In [442]:
df_trn.head(10)

,gender,age,person_id,became_member_on,income,offer_id,offer_completed_time,offer_received_time,offer_viewed_time,reward,...,duration,offer_type,social,web,email,mobile,person,event,time,amount
0,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0,0.0,...,4.0,informational,0.0,1.0,1.0,1.0,0610b486422d4921ae7d2bf64640c50b,transaction,18.0,21.51
1,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0,0.0,...,4.0,informational,0.0,1.0,1.0,1.0,0610b486422d4921ae7d2bf64640c50b,transaction,144.0,32.28
2,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0,0.0,...,4.0,informational,0.0,1.0,1.0,1.0,0610b486422d4921ae7d2bf64640c50b,transaction,528.0,23.22
3,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,528.0,408.0,1000.0,5.0,...,7.0,bogo,0.0,1.0,1.0,1.0,0610b486422d4921ae7d2bf64640c50b,transaction,18.0,21.51
4,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,528.0,408.0,1000.0,5.0,...,7.0,bogo,0.0,1.0,1.0,1.0,0610b486422d4921ae7d2bf64640c50b,transaction,144.0,32.28
5,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,528.0,408.0,1000.0,5.0,...,7.0,bogo,0.0,1.0,1.0,1.0,0610b486422d4921ae7d2bf64640c50b,transaction,528.0,23.22
6,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,...,3.0,informational,1.0,0.0,1.0,1.0,78afa995795e4d85b5d9ceeca43f5fef,transaction,132.0,19.89
7,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,...,3.0,informational,1.0,0.0,1.0,1.0,78afa995795e4d85b5d9ceeca43f5fef,transaction,144.0,17.78
8,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,...,3.0,informational,1.0,0.0,1.0,1.0,78afa995795e4d85b5d9ceeca43f5fef,transaction,222.0,19.67
9,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,...,3.0,informational,1.0,0.0,1.0,1.0,78afa995795e4d85b5d9ceeca43f5fef,transaction,240.0,29.72

In [443]:
#dropping unnecessary columns
df_trn.drop(columns=['person','event'],inplace=True)

In [444]:
df_trn.isnull().sum()

gender                     0
age                        0
person_id                  0
became_member_on           0
income                     0
offer_id                   0
offer_completed_time       0
offer_received_time        0
offer_viewed_time          0
reward                     0
difficulty                 0
duration                   0
offer_type                 0
social                     0
web                        0
email                      0
mobile                     0
time                    1235
amount                  1235
dtype: int64

In [445]:
#replace time column of people with no transactions with 1000
df_trn.time.fillna(1000,inplace=True)
#replace amount column of people with no transactions with 0
df_trn.amount.fillna(0,inplace=True)

#recheck
df_trn.isnull().sum().sum()

0

Some transactions could have happened before the person viewed the offer or after the expiry of the offer. Subsetting the transactions which happened during the offer window

In [446]:
#getting transactions that happened during the window person viewed and offer expiry
off_trn=df_trn.loc[(df_trn.time<=df_trn.offer_received_time+df_trn.duration*24)&(df_trn.time>=df_trn.offer_viewed_time)]
off_trn

,gender,age,person_id,became_member_on,income,offer_id,offer_completed_time,offer_received_time,offer_viewed_time,reward,difficulty,duration,offer_type,social,web,email,mobile,time,amount
8,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,0.0,3.0,informational,1.0,0.0,1.0,1.0,222.0,19.67
9,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,0.0,3.0,informational,1.0,0.0,1.0,1.0,240.0,29.72
13,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,132.0,0.0,6.0,5.0,5.0,7.0,bogo,0.0,1.0,1.0,1.0,132.0,19.89
14,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,132.0,0.0,6.0,5.0,5.0,7.0,bogo,0.0,1.0,1.0,1.0,144.0,17.78
25,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,ae264e3637204a6fb9bb56bc8210ddfd,510.0,408.0,408.0,10.0,10.0,7.0,bogo,1.0,0.0,1.0,1.0,510.0,21.72
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
471756,F,83,9dc1421481194dcd9400aec7c9ae6366,2016-03-07,50000.0,ae264e3637204a6fb9bb56bc8210ddfd,594.0,576.0,624.0,10.0,10.0,7.0,bogo,1.0,0.0,1.0,1.0,660.0,20.27
471757,F,83,9dc1421481194dcd9400aec7c9ae6366,2016-03-07,50000.0,ae264e3637204a6fb9bb56bc8210ddfd,594.0,576.0,624.0,10.0,10.0,7.0,bogo,1.0,0.0,1.0,1.0,684.0,11.11
471758,F,62,e4052622e5ba45a8b96b59aba68cf068,2017-07-22,82000.0,2298d6c36e964ae4a3e7e9706d1fb8c2,54.0,0.0,6.0,3.0,7.0,7.0,discount,1.0,1.0,1.0,1.0,54.0,21.55
471759,F,62,e4052622e5ba45a8b96b59aba68cf068,2017-07-22,82000.0,2298d6c36e964ae4a3e7e9706d1fb8c2,54.0,0.0,6.0,3.0,7.0,7.0,discount,1.0,1.0,1.0,1.0,84.0,25.19
471760,F,62,e4052622e5ba45a8b96b59aba68cf068,2017-07-22,82000.0,2298d6c36e964ae4a3e7e9706d1fb8c2,54.0,0.0,6.0,3.0,7.0,7.0,discount,1.0,1.0,1.0,1.0,96.0,21.53

In [447]:
#getting transactions that happened outside the window person viewed and offer expiry
non_off_trn=df_trn.loc[~((df_trn.time<=df_trn.offer_received_time+df_trn.duration*24)&(df_trn.time>=df_trn.offer_viewed_time))]
non_off_trn

,gender,age,person_id,became_member_on,income,offer_id,offer_completed_time,offer_received_time,offer_viewed_time,reward,difficulty,duration,offer_type,social,web,email,mobile,time,amount
0,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0,0.0,0.0,4.0,informational,0.0,1.0,1.0,1.0,18.0,21.51
1,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0,0.0,0.0,4.0,informational,0.0,1.0,1.0,1.0,144.0,32.28
2,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0,0.0,0.0,4.0,informational,0.0,1.0,1.0,1.0,528.0,23.22
3,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,528.0,408.0,1000.0,5.0,5.0,7.0,bogo,0.0,1.0,1.0,1.0,18.0,21.51
4,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,528.0,408.0,1000.0,5.0,5.0,7.0,bogo,0.0,1.0,1.0,1.0,144.0,32.28
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
471771,F,62,e4052622e5ba45a8b96b59aba68cf068,2017-07-22,82000.0,f19421c1d4aa40978ebb69ca19b0e20d,480.0,408.0,546.0,5.0,5.0,5.0,bogo,1.0,1.0,1.0,1.0,84.0,25.19
471772,F,62,e4052622e5ba45a8b96b59aba68cf068,2017-07-22,82000.0,f19421c1d4aa40978ebb69ca19b0e20d,480.0,408.0,546.0,5.0,5.0,5.0,bogo,1.0,1.0,1.0,1.0,96.0,21.53
471773,F,62,e4052622e5ba45a8b96b59aba68cf068,2017-07-22,82000.0,f19421c1d4aa40978ebb69ca19b0e20d,480.0,408.0,546.0,5.0,5.0,5.0,bogo,1.0,1.0,1.0,1.0,480.0,30.57
471774,F,62,e4052622e5ba45a8b96b59aba68cf068,2017-07-22,82000.0,f19421c1d4aa40978ebb69ca19b0e20d,480.0,408.0,546.0,5.0,5.0,5.0,bogo,1.0,1.0,1.0,1.0,486.0,19.47
471775,F,62,e4052622e5ba45a8b96b59aba68cf068,2017-07-22,82000.0,f19421c1d4aa40978ebb69ca19b0e20d,480.0,408.0,546.0,5.0,5.0,5.0,bogo,1.0,1.0,1.0,1.0,690.0,24.71

Modifying the offer variables in non_offer_transaction dataframe

In [448]:
#replacing offer_id column in non_off_trn with ""
non_off_trn['offer_id']=""

In [449]:
#replacing offer time columns in non_off_trn with 1000
non_off_trn[['offer_completed_time','offer_received_time','offer_viewed_time']]=1000

In [450]:
offer_char=list(portfolio.columns)
offer_char.remove('id')
offer_char.remove('offer_type')
offer_char

['reward', 'difficulty', 'duration', 'social', 'web', 'email', 'mobile']

In [451]:
#replacing offer type characteristics with None
non_off_trn['offer_type']= 'None'

#replacing all offer characteristics with 0
non_off_trn[offer_char]=0

In [452]:
non_off_trn.head()

,gender,age,person_id,became_member_on,income,offer_id,offer_completed_time,offer_received_time,offer_viewed_time,reward,difficulty,duration,offer_type,social,web,email,mobile,time,amount
0,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,,1000,1000,1000,0,0,0,None,0,0,0,0,18.0,21.51
1,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,,1000,1000,1000,0,0,0,None,0,0,0,0,144.0,32.28
2,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,,1000,1000,1000,0,0,0,None,0,0,0,0,528.0,23.22
3,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,,1000,1000,1000,0,0,0,None,0,0,0,0,18.0,21.51
4,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,,1000,1000,1000,0,0,0,None,0,0,0,0,144.0,32.28

Concatenating off_trn and non_off_trn dataframe

In [453]:
df_trn=pd.concat([off_trn, non_off_trn])
df_trn.head()

,gender,age,person_id,became_member_on,income,offer_id,offer_completed_time,offer_received_time,offer_viewed_time,reward,difficulty,duration,offer_type,social,web,email,mobile,time,amount
8,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,0.0,3.0,informational,1.0,0.0,1.0,1.0,222.0,19.67
9,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,0.0,3.0,informational,1.0,0.0,1.0,1.0,240.0,29.72
13,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,132.0,0.0,6.0,5.0,5.0,7.0,bogo,0.0,1.0,1.0,1.0,132.0,19.89
14,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,132.0,0.0,6.0,5.0,5.0,7.0,bogo,0.0,1.0,1.0,1.0,144.0,17.78
25,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,ae264e3637204a6fb9bb56bc8210ddfd,510.0,408.0,408.0,10.0,10.0,7.0,bogo,1.0,0.0,1.0,1.0,510.0,21.72

In this dataframe, the offer details where a person got an offer but didn't make any transactions during that offer period are missing. We can get them by outer of df_clean and df_trn

In [463]:
df_final=pd.merge(df_clean,df_trn,how='outer')

In [465]:
#filling na values with 1000 for time and 0 for amount
df_final.time.fillna(1000,inplace=True)
df_final.amount.fillna(0,inplace=True)

In [467]:
df_final['transaction']=df_final.amount.apply(lambda x: 1 if x!=0 else 0)

In [468]:
df_final.head()

,gender,age,person_id,became_member_on,income,offer_id,offer_completed_time,offer_received_time,offer_viewed_time,reward,difficulty,duration,offer_type,social,web,email,mobile,time,amount,transaction
0,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,3f207df678b143eea3cee63160fa8bed,1000.0,504.0,1000.0,0.0,0.0,4.0,informational,0.0,1.0,1.0,1.0,1000.0,0.00,0
1,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,528.0,408.0,1000.0,5.0,5.0,7.0,bogo,0.0,1.0,1.0,1.0,1000.0,0.00,0
2,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,0.0,3.0,informational,1.0,0.0,1.0,1.0,222.0,19.67,1
3,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,5a8bc65990b245e5a138643cd4eb9837,1000.0,168.0,216.0,0.0,0.0,3.0,informational,1.0,0.0,1.0,1.0,240.0,29.72,1
4,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,9b98b8c7a33c4b65b9aebfe6a799e6d9,132.0,0.0,6.0,5.0,5.0,7.0,bogo,0.0,1.0,1.0,1.0,132.0,19.89,1

The final dataframe has person, offer and transaction information. Each row represents a unique combination of person, offer and transactions. There are three combinations in the dataframe:

1. Person-Offer-Transaction
2. Person-No Offer-Transaction
3. Person-Offer-No Transaction

## Exploratory Data Analysis